[
  {
    "name": "Ada Rose Cannon",
    "pic": "ada-rose-cannon.jpeg",
    "bio": "Developer Advocate da Samsung para o navegador <a href=\"https://twitter.com/SamsungInternet\">@SamsungInternet</a>. Web fangirl. Geralmente em Londres. WebXR Device API, Web Components, PWA.",
    "faceAt": "center top"
  },
  {
    "name": "Kyle Simpson",
    "pic": "kyle-simpson.jpeg",
    "bio": "É um escritor, palestrante, professor, e contribuidor em projetos open-source. Evangelista da open web, apaixonado por todas as coisas relacionadas ao javascript.",
    "faceAt": "center center"
  },
  {
    "name": "Mathias Bynens",
    "pic": "mathias-bynens.jpeg",
    "bio": "Mathias works on the V8 JavaScript engine at Google and on the ECMAScript standard through TC39.",
    "faceAt": "center left"
  },
  {
    "name": "Adam Baldwin",
    "pic": "adam-baldwin.jpeg",
    "bio": "Adam Baldwin is the Head of Security at npm inc. He is the Founder of the Node Security Project & talks about javascript security non-stop. In his free time Adam enjoys doing basically the exact same stuff he does for work, also raising chickens, and spending as much time as possible with his wife and 2 children.",
    "faceAt": "center top"
  },
  {
    "name": "Fagner Martins",
    "pic": "fagner-martins.jpg",
    "bio": "Fagner Brack works as a Software Engineer at MYOB Australia. In his spare time, Fagner likes to read books and blog posts. He is also a blog writer, Redditor, and Open Source contributor.",
    "faceAt": "center top"
  },
  {
    "name": "Mario Souto",
    "pic": "mario-souto.jpeg",
    "bio": "Vivo no 220v, tô sempre procurando coisas novas para fazer e finalmente estou me achando no mundo dos esportes gastando essa energia com corridas. Adoro codar desafios aleatórios, fazer sites, ensinar sobre, e hoje consigo fazer tudo isso pela Caelum e Alura.",
    "faceAt": "center right"
  },
  {
    "name": "Monica Lent",
    "pic": "monica-lent.jpg",
    "bio": "Monica is the Frontend Lead at SumUp, a multinational FinTech startup. Before moving to Berlin, she worked in domains such as natural language processing and cloud technologies.",
    "faceAt": "center bottom"
  },
  {
    "name": "Claudia Hernández",
    "pic": "claudia-hernandez.jpg",
    "bio": "Claudia Hernández is a mexican frontend developer at Auth0. She has previously worked at Dailymotion in Paris and on projects for companies such as Air France, EDF, Groupe SEB and Aéroport de Paris. Claudia has a computer science background and loves learning emerging web technologies. When she is not coding, chances are you’ll find her reading a book ! Claudia also loves travelling and discovering new cultures.",
    "faceAt": "center center"
  },
  {
    "name": "Caroline Soares",
    "pic": "caroline-soares.jpg",
    "bio": "Desenvolvedora Front end, estudante de Sistemas para Internet, podcaster e professora.",
    "faceAt": "center center"
  },
  {
    "name": "Isa Silveira",
    "pic": "isa-silveira.jpg",
    "bio": "Isa é uma engenheira de software construindo grandes produtos digitais na Work&Co. Ao longo de sua carreira, ela já atuou na área da pesquisa científica, back-end e front-end para web e mobile, e trabalhou em projeto para clientes internacionais como a Universidade de Stanford, Banco Votorantim e o Grupo Estadão. Não nega uma cerveja e uma boa conversa, no seu tempo livre ela gosta de praticar slalom nos patins e brincar com seus cachorros.",
    "faceAt": "center top"
  },
  {
    "name": "Daniel Ehrenberg",
    "pic": "daniel-ehrenberg.jpg",
    "bio": "I work on TC39 and occasionally contribute to V8. I work for Igalia, a Galician consultancy which adds features to JavaScript and the Web Platform, as well as embedding web browsers in various products. I live with my partner outside of Barcelona.",
    "faceAt": "center center"
  },
  {
    "name": "Rafael Specht da Silva",
    "pic": "rafael-silva.jpg",
    "bio": "Desenvolvedor web, apreciador de chiptunes, sommelier de gifs, entusiasta das APIs fantásticas da web. Já palestrou no mesmo palco do Brendan Eich duas vezes (o que não significa nada, mas deixou-o bem nervoso).",
    "faceAt": "center left"
  },
  {
    "name": "István Szmozsánszky",
    "pic": "flaki.png",
    "bio": "István Szmozsánszky (or Flaki, for short) teaches JS & frontend development, working with Mozilla's DevRel team promoting modern web technologies. He loves JavaScript internals & playing (quite literally!) with microcontrollers."
  },
  {
    "name": "Evangelina Ferreira",
    "pic": "eva-ferreira.jpg",
    "bio": "Evangelina Ferreira is a front-end developer and teacher. She is currently working at Aerolab as a UI Developer and has been teaching web technologies at the National Technological University of Argentina for more than five years. In her free time she organizes CSSConf Argentina."
  },
  {
    "name": "",
    "pic": "",
    "bio": ""
  },
  {
    "name": "",
    "pic": "",
    "bio": ""
  }
]
